cask "dotnet-sdk"
cask "java"
brew "coreutils"
brew "bash"
brew "node"
brew "php@7.4"
brew "gnu-sed"
brew "grep"
brew "gawk"
brew "erlang"
brew "elixir"
brew "rebar3"
brew "cabal-install"
brew "icu4c"
brew "elixir"
brew "python"
brew "ninja"
brew "maven"
brew "rust"
brew "golang"
brew "pkg-config"
brew "markdown"
brew "composer"
brew "wget"
brew "ghc"
brew "json-glib"
brew "zlib"
brew "perl"
brew "rakudo-star"
